# Local Variables;
# org-ref-default-bibliography: REFERENCES.bib
#+LaTeX_CLASS_OPTIONS: [a4paper,twoside,11pt]
#+TITLE: Football data analysis 
#+SUBTITLE: An example with the ~Countr~ package.
#+PROPERTY: header-args:R :cache yes :session foot-r :results output :exports both
#+PROPERTY: header-args:R  :tangle ./football.R 
#+LaTeX_CLASS: article_tarak
#+OPTIONS: author:nil
#+OPTIONS: toc:nil
#+INCLUDE:"../custom_packages.org"
#+LATEX_HEADER: \author[1]{Tarak Kharrat}
#+LATEX_HEADER: \author[2]{Georgi N. Boshnakov}
#+LATEX_HEADER: \affil[1]{Salford Business School, University of Salford, UK.}
#+LATEX_HEADER: \affil[2]{School of Mathematics, University of Manchester, UK.}
#+LATEX_HEADER: \newcommand{\countr}{\texttt{Countr}\xspace}

#+BEGIN_abstract
The main motivation to develop the ~Countr~ by the authors was to create an
alternative to the Poisson model to fit the number of goals scored by a team in
a football match. Despite its clear limitations, the Poisson model was
systematically used in the literature perhaps due to its simplicity. We briefly
explain in this document why the renewal-count models should be preferred for
football data. We hope that the development of the ~Countr~ package will
encourage more data analyst to use renewal-count models, especially when
investigating sports data.

This vignette is part of package ~Countr~ \citep[see][]{CountrJssArticle}.
#+END_abstract

Before starting our analysis, we need to load the useful packages. On top of
~Countr~, the ~dplyr~ package \citep{dplyr2016} will be used:
#+NAME: load-pkg
#+BEGIN_SRC R :results value silent
library(Countr)
library(dplyr)
#+END_SRC

** Likelihood ratio test
The Poisson model is a special case of the weibull-count with shape parameter
set to 1. Therefore, the two models are nested and the likelihood ratio can be
used to discriminate between them as explained in \citet[Chapter 6]{cameron2013regression}:
#+NAME: lr-test
#+BEGIN_SRC R :results none
library(lmtest)
lr <- lrtest(away_poiss, away_wei)
#+END_SRC


#+BEGIN_SRC R
lr
#+END_SRC

#+RESULTS[717cc96375bf679e016c638bdbee25d593cec564]:
: Likelihood ratio test
: 
: Model 1: awayTeamGoals ~ 1
: Model 2: awayTeamGoals ~ 1
:   #Df  LogLik Df  Chisq Pr(>Chisq)    
: 1   1 -4364.3                         
: 2   2 -4350.1  1 28.484  9.448e-08 ***
: ---
: Signif. codes:  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1




The likelihood ratio test null hypothesis (both model present equal fits) is
rejected at any convenience level and confirms that the Weibull addition
induced by the shape parameter does improve the fitting.

** Chi-square goodness-of-fit test
Finally, a formal chi-square goodness-of-fit test has been described in in
\citet[Section 5.3.4]{cameron2013regression} and implemented in 
~Countr::chiSq_gof()~. It can be used to judge how well the weibull model
describes the data:
#+NAME: gof-test
#+BEGIN_SRC R
gof_wei <- chiSq_gof(away_wei, breaks = breaks_)
gof_pois <- chiSq_gof(away_poiss, breaks = breaks_)
print(gof_wei)
#+END_SRC

#+RESULTS[606d3261eeb645a0e242abd2b5411b22759d65c7]: gof-test
: chi-square goodness-of-fit test
: 
: Cells considered 0 1 2 3 4 >= 5
:   DF  Chisq Pr(>Chisq)
: 1  5 7.1479     0.2099


The test concludes that the null hypothesis cannot be rejected (and hence that
the weibull-count model describes the data well). Note that the same statistic
computed for the Poisson model yields a value src_R[:exports results :results
value raw]{formatC(gof_pois[, 2])} compared to $\chi^2(5)$ critical value of
$9.24$ at 5%. The Poisson model is hence strongly rejected.

